xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    py32l090_hal_rcc_ex.h
  * @author  MCU Application Team
  * @brief   Header file of RCC HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32L090_HAL_RCC_EX_H
#define __PY32L090_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l090_hal_def.h"

/** @addtogroup PY32L090_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Private Constants ---------------------------------------------------------*/
/* Private Macros ------------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Macros
 * @{
 */

#define IS_RCC_PLL_MUL(__MUL__) ((__MUL__) <= RCC_PLL_MUL18)
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || ((__SOURCE__) == RCC_MCOSOURCE_HSI) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSE)    || ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_LSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LSE) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HCLK)   || ((__SOURCE__) == RCC_MCOSOURCE_PCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_MSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LCD_HSI10M))
#elif defined(RCC_HSE_SUPPORT) 
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || ((__SOURCE__) == RCC_MCOSOURCE_HSI) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSE)    || ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_LSI) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HCLK)   || ((__SOURCE__) == RCC_MCOSOURCE_PCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_MSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LCD_HSI10M))
#elif defined(RCC_LSE_SUPPORT) 
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || ((__SOURCE__) == RCC_MCOSOURCE_HSI) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_LSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LSE) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HCLK)   || ((__SOURCE__) == RCC_MCOSOURCE_PCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_MSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LCD_HSI10M))
#else
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || ((__SOURCE__) == RCC_MCOSOURCE_HSI) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_LSI)  \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_HCLK)   || ((__SOURCE__) == RCC_MCOSOURCE_PCLK) \
                                    || ((__SOURCE__) == RCC_MCOSOURCE_MSI)    || ((__SOURCE__) == RCC_MCOSOURCE_LCD_HSI10M))
#endif
#if defined(RCC_CCIPR_CANSEL)
#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_CANCLKSOURCE(__CANCLK__)  (((__CANCLK__) == RCC_CANCLKSOURCE_PLL) || ((__CANCLK__) == RCC_CANCLKSOURCE_PCLK)   || \
                                          ((__CANCLK__) == RCC_CANCLKSOURCE_HSE))
#else
#define IS_RCC_CANCLKSOURCE(__CANCLK__)  (((__CANCLK__) == RCC_CANCLKSOURCE_PLL) || ((__CANCLK__) == RCC_CANCLKSOURCE_PCLK))
#endif
#endif
#define IS_RCC_PVDDETECTCLKSOURCE(__PVDDETECTCLK__)  (((__PVDDETECTCLK__) == RCC_PVDDETECTCLKSOURCE_PCLK) || ((__PVDDETECTCLK__) == RCC_PVDDETECTCLKSOURCE_LSC))

#define IS_RCC_COMP1CLKSOURCE(__COMP1CLK__)  (((__COMP1CLK__) == RCC_COMP1CLKSOURCE_PCLK) || ((__COMP1CLK__) == RCC_COMP1CLKSOURCE_LSC))

#define IS_RCC_COMP2CLKSOURCE(__COMP2CLK__)  (((__COMP2CLK__) == RCC_COMP2CLKSOURCE_PCLK) || ((__COMP2CLK__) == RCC_COMP2CLKSOURCE_LSC))
#if defined(RCC_LSE_SUPPORT) 
#define IS_RCC_LPUART1CLKSOURCE(__LPUART1CLK__) (((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_PCLK) || ((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_SYSCLK) || \
                                                 ((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_LSI)  || ((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_LSE))
#else
#define IS_RCC_LPUART1CLKSOURCE(__LPUART1CLK__) (((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_PCLK) || ((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_SYSCLK) || \
                                                 ((__LPUART1CLK__) == RCC_LPUART1CLKSOURCE_LSI))
#endif
#if defined(RCC_LSE_SUPPORT) 
#define IS_RCC_LPUART2CLKSOURCE(__LPUART2CLK__) (((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_PCLK) || ((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_SYSCLK) || \
                                                 ((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_LSI)  || ((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_LSE))
#else
#define IS_RCC_LPUART2CLKSOURCE(__LPUART2CLK__) (((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_PCLK) || ((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_SYSCLK) || \
                                                 ((__LPUART2CLK__) == RCC_LPUART2CLKSOURCE_LSI))
#endif

#if defined(RCC_LSE_SUPPORT) 
#define IS_RCC_LPTIM1CLKSOURCE(__LPTIM1CLK__)  (((__LPTIM1CLK__) == RCC_LPTIM1CLKSOURCE_PCLK) || ((__LPTIM1CLK__) == RCC_LPTIM1CLKSOURCE_LSI) || \
                                                ((__LPTIM1CLK__) == RCC_LPTIM1CLKSOURCE_LSE))
#else
#define IS_RCC_LPTIM1CLKSOURCE(__LPTIM1CLK__)  (((__LPTIM1CLK__) == RCC_LPTIM1CLKSOURCE_PCLK) || ((__LPTIM1CLK__) == RCC_LPTIM1CLKSOURCE_LSI))
#endif
#if defined(RCC_LSE_SUPPORT) 
#define IS_RCC_LPTIM2CLKSOURCE(__LPTIM2CLK__)  (((__LPTIM2CLK__) == RCC_LPTIM2CLKSOURCE_PCLK) || ((__LPTIM2CLK__) == RCC_LPTIM2CLKSOURCE_LSI) || \
                                                ((__LPTIM2CLK__) == RCC_LPTIM2CLKSOURCE_LSE))
#else
#define IS_RCC_LPTIM2CLKSOURCE(__LPTIM2CLK__)  (((__LPTIM2CLK__) == RCC_LPTIM2CLKSOURCE_PCLK) || ((__LPTIM2CLK__) == RCC_LPTIM2CLKSOURCE_LSI))
#endif
#define IS_RCC_ADCCLKSOURCE(__ADCCLK__) (((__ADCCLK__) == RCC_ADCCLKSOURCE_SYSCLK)  || ((__ADCCLK__) == RCC_ADCCLKSOURCE_PLL)   || \
                                         ((__ADCCLK__) == RCC_ADCCLKSOURCE_HSI))

