xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc_ex.h
#if defined(RCC_CCIPR_CANSEL)
#define IS_RCC_PERIPHCLOCK(PERIPHCLOCK)  (((PERIPHCLOCK) == RCC_PERIPHCLK_RTC) || ((PERIPHCLOCK) == RCC_PERIPHCLK_IWDG)        || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_CAN) || ((PERIPHCLOCK) == RCC_PERIPHCLK_PVD)      || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_COMP1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_COMP2)  || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_LPUART1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_LPUART2) || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_LPTIM1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_LPTIM2) || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_ADC))
#else
#define IS_RCC_PERIPHCLOCK(PERIPHCLOCK)  (((PERIPHCLOCK) == RCC_PERIPHCLK_RTC) || ((PERIPHCLOCK) == RCC_PERIPHCLK_IWDG)        || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_PVD)      || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_COMP1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_COMP2)  || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_LPUART1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_LPUART2) || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_LPTIM1) || ((PERIPHCLOCK) == RCC_PERIPHCLK_LPTIM2) || \
                                          ((PERIPHCLOCK) == RCC_PERIPHCLK_ADC))
#endif

#if defined(RCC_LSE_SUPPORT) 
#define IS_RCC_LSCSOURCE(__LSCCLK__)  (((__LSCCLK__) == RCC_LSCSOURCE_LSI) || ((__LSCCLK__) == RCC_LSCSOURCE_LSE))
#else
#define IS_RCC_LSCSOURCE(__LSCCLK__)  (((__LSCCLK__) == RCC_LSCSOURCE_LSI))
#endif

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;            /*!< The Extended Clock to be configured.
                                            This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t RTCClockSelection;              /*!< specifies the RTC clock source.
                                             This parameter can be a value of @ref RCC_RTC_Clock_Source */

  uint32_t IwdgClockSelection;              /*!< specifies the IWDG clock source.
                                             This parameter can be a value of @ref RCC_IWDG_Clock_Source */
#if defined(RCC_CCIPR_CANSEL)
  uint32_t CanClockSelection;              /*!< CAN clock source
                                            This parameter can be a value of @ref RCCEx_CAN_Clock_Source */
#endif
  uint32_t PvdDetectClockSelection;        /*!< PVD detect clock source
                                            This parameter can be a value of @ref RCCEx_PVD_Detect_Clock_Source */
  
  uint32_t Comp1ClockSelection;            /*!< COMP1 clock source
                                            This parameter can be a value of @ref RCCEx_COMP1_Clock_Source */
  
  uint32_t Comp2ClockSelection;            /*!< COMP2 clock source
                                            This parameter can be a value of @ref RCCEx_COMP2_Clock_Source */
  
  uint32_t Lpuart1ClockSelection;          /*!< LPUART1 clock source
                                            This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */
  
  uint32_t Lpuart2ClockSelection;          /*!< LPUART2 clock source
                                            This parameter can be a value of @ref RCCEx_LPUART2_Clock_Source */
  
  uint32_t Lptim1ClockSelection;            /*!< LPTIM1 clock source
                                            This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */
  
  uint32_t Lptim2ClockSelection;            /*!< LPTIM2 clock source
                                            This parameter can be a value of @ref RCCEx_LPTIM2_Clock_Source */
  
  uint32_t AdcClockSelection;              /*!< ADC clock source
                                            This parameter can be a value of @ref RCCEx_ADC_Clock_Source */
} RCC_PeriphCLKInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_RTC           0x00000001U
#define RCC_PERIPHCLK_IWDG          0x00000002U
#if defined(RCC_CCIPR_CANSEL)
#define RCC_PERIPHCLK_CAN           0x00000004U
#endif
#define RCC_PERIPHCLK_PVD           0x00000008U
#define RCC_PERIPHCLK_COMP1         0x00000010U
#define RCC_PERIPHCLK_COMP2         0x00000020U
#define RCC_PERIPHCLK_LPUART1       0x00000040U
#define RCC_PERIPHCLK_LPUART2       0x00000080U
#define RCC_PERIPHCLK_LPTIM1        0x00000100U
#define RCC_PERIPHCLK_LPTIM2        0x00000200U
#define RCC_PERIPHCLK_ADC           0x00000400U
/**
  * @}
  */

/** @defgroup RCCEx_LSC_Clock_Source LSC Clock Source
  * @{
  */
#define RCC_LSCSOURCE_LSI              0x00000000U
#if defined(RCC_LSE_SUPPORT)
#define RCC_LSCSOURCE_LSE              RCC_BDCR_LSCSEL
#endif
/**
  * @}
  */

#if defined(RCC_CCIPR_CANSEL)
/** @defgroup RCCEx_CAN_Clock_Source CAN Clock Source
  * @{
  */
#define RCC_CANCLKSOURCE_PLL           0x00000000U
#define RCC_CANCLKSOURCE_PCLK          RCC_CCIPR_CANSEL_0
#if defined(RCC_HSE_SUPPORT)
#define RCC_CANCLKSOURCE_HSE           RCC_CCIPR_CANSEL_1
#endif
/**
  * @}
  */
#endif

/** @defgroup RCCEx_PVD_Detect_Clock_Source PVD Detect Clock Source
  * @{
  */
#define RCC_PVDDETECTCLKSOURCE_PCLK    0x00000000U
#define RCC_PVDDETECTCLKSOURCE_LSC     RCC_CCIPR_PVDSEL
/**
  * @}
  */

/** @defgroup RCCEx_COMP1_Clock_Source COMP1 Clock Source
  * @{
  */
#define RCC_COMP1CLKSOURCE_PCLK        0x00000000U
#define RCC_COMP1CLKSOURCE_LSC         RCC_CCIPR_COMP1SEL
/**
  * @}
  */

/** @defgroup RCCEx_COMP2_Clock_Source COMP2 Clock Source
  * @{
  */
#define RCC_COMP2CLKSOURCE_PCLK        0x00000000U
#define RCC_COMP2CLKSOURCE_LSC         RCC_CCIPR_COMP2SEL
/**
  * @}
  */

/** @defgroup RCCEx_LPUART1_Clock_Source LPUART1 Clock Source
  * @{
  */
#define RCC_LPUART1CLKSOURCE_PCLK      0x00000000U
#define RCC_LPUART1CLKSOURCE_SYSCLK    RCC_CCIPR_LPUART1SEL_0
#define RCC_LPUART1CLKSOURCE_LSI       RCC_CCIPR_LPUART1SEL_1
#if defined(RCC_LSE_SUPPORT)
#define RCC_LPUART1CLKSOURCE_LSE       (RCC_CCIPR_LPUART1SEL_0 | RCC_CCIPR_LPUART1SEL_1)
#endif
/**
  * @}
  */

/** @defgroup RCCEx_LPUART2_Clock_Source LPUART1 Clock Source
  * @{
  */
#define RCC_LPUART2CLKSOURCE_PCLK      0x00000000U
#define RCC_LPUART2CLKSOURCE_SYSCLK    RCC_CCIPR_LPUART2SEL_0
#define RCC_LPUART2CLKSOURCE_LSI       RCC_CCIPR_LPUART2SEL_1
#if defined(RCC_LSE_SUPPORT)
#define RCC_LPUART2CLKSOURCE_LSE       (RCC_CCIPR_LPUART2SEL_0 | RCC_CCIPR_LPUART2SEL_1)
#endif
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_PCLK       0x00000000U
#define RCC_LPTIM1CLKSOURCE_LSI        RCC_CCIPR_LPTIM1SEL_0
#if defined(RCC_LSE_SUPPORT)
#define RCC_LPTIM1CLKSOURCE_LSE        RCC_CCIPR_LPTIM1SEL
#endif
/**
  * @}
  */
  
/** @defgroup RCCEx_LPTIM2_Clock_Source LPTIM2 Clock Source
  * @{
  */
#define RCC_LPTIM2CLKSOURCE_PCLK       0x00000000U
#define RCC_LPTIM2CLKSOURCE_LSI        RCC_CCIPR_LPTIM2SEL_0
#if defined(RCC_LSE_SUPPORT)
#define RCC_LPTIM2CLKSOURCE_LSE        RCC_CCIPR_LPTIM2SEL
#endif
/**
  * @}
  */
  
/** @defgroup RCCEx_ADC_Clock_Source ADC Clock Source
  * @{
  */
#define RCC_ADCCLKSOURCE_SYSCLK        0x00000000U
#define RCC_ADCCLKSOURCE_PLL           RCC_CCIPR_ADCSEL_0
#define RCC_ADCCLKSOURCE_HSI           RCC_CCIPR_ADCSEL_1
/**
  * @}
  */

/** @defgroup RCCEx_TIM_PCLK_Frequency_Control TIM PCLK Frequency Control
  * @{
  */
#define RCC_TIMPCLK_MUL2       0x00000000U              /*!< TIMER PCLK is twice the system PCLK, but the frequency will not exceed HCLK */
#define RCC_TIMPCLK_MUL1       RCC_CCIPR_TIMCLKCTRL     /*!< TIMER PCLK is the system PCLK */
/**
  * @}
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
 * @{
 */

/**
  * @}
  */

/** @defgroup RCCEx_HSE_Configuration HSE Configuration
  * @{
  */

/**
  * @}
  */

/** @defgroup RCCEx_Peripheral_Configuration Peripheral Configuration
  * @brief  Macros to configure clock source of different peripherals.
  * @{
  */
#if defined(RCC_CCIPR_CANSEL)
/** @brief  Macro to configure the CAN clock.
  * @param  __CANCLKSOURCE__ specifies the CAN clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_CANCLKSOURCE_PLL   PLL clock selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PCLK  PCLK clock selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_HSE   HSE selected as CAN clock
*/
#define __HAL_RCC_CAN_CONFIG(__CANCLKSOURCE__) \
                  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_CANSEL, (uint32_t)(__CANCLKSOURCE__))

